from random import randint

# Задание 1
#1.1

def x():
    lol = randint(1, 100)
    return lol

print(x() - x())
print(x() + x())
print(x() / x())
print(x() * x())


print('\n')
#1.2
# Сделаем вид что вместо функции x() везде int(input())

print(f'Введите исходные данные фигуры.\n')

a, b, c = x(), x(), x()

print(f'Выберите, что хотите посчитать и напишите цифру. \n Площадь - 1\n Периметр - 2\n')

heh = randint(1, 2)
print(heh)

if heh == 1:
    print(f'Площадь фигуры со сторонами {a} и {b}: {a * b}\n')
elif heh == 2:
    print(f'Выберите вашу фигуру. \n Квадрат - 1\n Прямоугольник - 2\n Треугольник - 3\n')
    heh2 = randint(1, 3)
    print(heh2)
    if heh2 == 1:
        print(f'Периметр равен {a * 4}\n')
    elif heh2 == 2:
        print(f'Периметр равен {(a + b) * 2}\n')
    elif heh2 == 3:
        print(f'Периметр равен {a + b + c}\n')

# Задание 2
# 2.1

print(x() > x())
print(x() < x())

# 2.2
# Сделаем вид что вместо функции x() везде int(input())

print('\n Введите три числа.')
print(f'Максимальное число из введенных: {max(x(), x(), x())}')

# Задание 3
# 3.1

print('\n Введите три числа, чтобы выяснить наименьшее из них.')
a, b, c = x(), x(), x()
print(f'Введенные числа: {a}, {b}, {c}')

if a == min(a, b, c):
    print(f'Первое число наименьшее.')
elif b == min(a, b, c):
    print(f'Второе число наименьшее.')
elif c == min(a, b, c):
    print(f'Третье число наименьшее.')
    
# 3.2

print(f'\n Введите ваш возраст, чтобы понять, какой билет необходимо купить и по какой стоимости.')

age = x()
print(f'Введенный возраст: {age}')

if age < 18:
    print(f'Покупайте детский билет, стоимость {x()}$')
if age > 18:
    print(f'Покупайте взрослый билет, стоимость {x()}$')

print('\n')

# Задание 4
# 4.1

a = 5  
b = 3  

print(f"Побитовое И: {a & b}")  
print(f"Побитовое ИЛИ: {a | b}")  
print(f"Побитовое ИСКЛЮЧАЮЩЕЕ ИЛИ: {a ^ b}")  
print(f"Побитовое НЕ: {~a}")  
print(f"Сдвиг влево: {a << 1}")  
print(f"Сдвиг вправо: {a >> 1}")  

print('\n')

# 4.2

print(f"Установка 3-го бита: {a | (1 << 2)}")  # 0111
print(f"Сброс 2-го бита: {7 & ~(1 << 1)}")  # 0101
print(f"Сдвиг влево на 2 бита: {a << 2}")  # 10100
print(f"Сдвиг вправо на 2 бита: {a >> 2}")  # 0001

print('\n')

# Задание 5
# 5.1

a = 10
print(f"Целое число: {a}")
b = "Hello, World!"
print(f"Строка: {b}")
c = [1, 2, 3, 4, 5]
print(f"Список: {c}")
d = (1, 2, 3)
print(f"Кортеж: {d}")
e = {"name": "Alice", "age": 30}
print(f"Словарь: {e}")
f = True
print(f"Булево значение: {f}")


print('\n')

# 5.2

a = 5
a += 3  
print(f"a после +=: {a}")

b = 10
b -= 4  
print(f"b после -=: {b}")

c = 2
c *= 3  
print(f"c после *=: {c}")

d = 15
d /= 5  
print(f"d после /=: {d}")

e = 7
e %= 3  
print(f"e после %=: {e}")

f = 2
f **= 3  
print(f"f после **=: {f}")

g = 10
g //= 3  
print(f"g после //=: {g}")